<template>
    <div>
        <div class="menu">
            <p class="menu-header" >Меню</p>
            <router-link class="router-link" to="/"> На главную </router-link>
            <router-link class="router-link" to="/tasks"> Задания </router-link>
        </div>
        <div>
            <p class="textinformation">
                За все время производства автомобилей и их прототипов было использовано бесчисленное количество двигателей, начиная с паровых, заканчивая современными поршневыми.
Разобраться во всем этом многообразии обычному человеку действительно не просто. Wikimotors постарается вам помочь в этом. Здесь рассматриваются современные и относительно современные двигатели автомобилей, преимущественно бензиновые, но некоторая часть будет отведена под роторные, дизельные и электромоторы. Кроме общего обзора, мы рассмотрим основные проблемы, неисправности, недостатки и конструкционные просчеты моторов, а также, их ремонт, как устранить возникшую неприятность и снова получать удовольствие от ровной работы движка.
Помимо того, вы узнаете, какое масло рекомендуется лить в ваш двигатель, необходимый его объем и сроки замены. В каждом обзоре имеется примерный ресурс мотора, его технические характеристики, вы также узнаете, какие марки двигателей ставились на нужную вам модель автомобиля.
Достаточно большое количество людей любит активное вождение и высокую скорость, но позволить себе купить Lamborghini может не каждый. Выбрав свой автомобиль, мы поведаем, как правильно увеличить мощность двигателя и заставить его ехать так быстро, как только это возможно за адекватные деньги.
Именно на Викимоторс вы узнаете, какой двигатель автомобиля надежней, совершенней и лучше подходит под ваш стиль езды.
            </p>
        </div>
    </div>
</template>
<style scoped>
.menu {
    margin-top: 30px;
}
.information {
    border: solid 1px black ;
    border-radius: 20px;
    width: 700px;
    height: 3050px;
    background-color: rgb(125, 165, 165);
    margin-bottom: 20px;
    margin-top: 40px;
    margin-left: auto;
    margin-right: auto;
}
.table-body {
    width: 700px;
    height: 500px;
    margin-left: auto;
    margin-right: auto;
    padding: 20px;
}
.textinformation {
    max-width: 600px;
    margin:auto
}
</style>
