<template>
<div>
     <div class="menu">
                <p class="menu-header" >Меню</p>
                <router-link class="router-link" to="/"> На главную </router-link>
                <router-link class="router-link" to="/tasks"> Задания </router-link>
        </div>
     <div class="information">
         <h2 class="information-title" style="color: black">Лень выдумывать что-то, поэтому вот информация <br> про двигатель M30B34</h2>
         <table >
             <body class="table-body">
                 <tr class="tr">
                     <th class="th">Производство</th>
                     <th class="th"> Munich Plant</th>
                 </tr>
                  <tr>
                     <th class="th">Марка двигателя</th>
                     <th class="th">М30</th>
                 </tr>
                  <tr>
                     <th class="th">Годы выпуска</th>
                     <th class="th">1982-1992
</th>
                 </tr>
                  <tr>
                     <th class="th">Материал блока цилиндров</th>
                     <th class="th">чугун</th>
                 </tr>
                  <tr>
                     <th class="th">Система питания</th>
                     <th class="th">инжектор</th>
                 </tr>
                 <tr>
                     <th class="th">Тип</th>
                     <th class="th">рядный</th>
                 </tr>
                 <tr>
                     <th class="th">Количество цилиндров</th>
                     <th class="th">6</th>
                 </tr>
                 <tr>
                     <th class="th">Клапанов на цилиндр</th>
                     <th class="th">2</th>
                 </tr>
                 <tr>
                     <th class="th">Ход поршня, мм</th>
                     <th class="th">86</th>
                 </tr>
                 <tr>
                     <th class="th">Диаметр цилиндра, мм</th>
                     <th class="th">92</th>
                 </tr>
                 <tr>
                     <th class="th">Степень сжатия</th>
                     <th class="th">8.0 <br> 9.0 <br> 10.0 <br> (см. описание) </th>
                 </tr>
                 <tr>
                     <th class="th">Объем двигателя, куб.см</th>
                     <th class="th">3430</th>
                 </tr>
                 <tr>
                     <th class="th">Мощность двигателя, л.с./об.мин</th>
                     <th class="th">185/5400 <br> 211/5700 <br> 218/5500 <br>(см. описание)</th>
                 </tr>
                 <tr>
                     <th class="th">Крутящий момент, Нм/об.мин</th>
                     <th class="th">290/4000 <br> 305/4000 <br> 310/4000 <br> (см. описание)</th>
                 </tr>
                 <tr>
                     <th class="th">Топливо</th>
                     <th class="th">92</th>
                 </tr>
                 <tr>
                     <th class="th">Экологические нормы</th>
                     <th class="th">null</th>
                 </tr>
                 <tr>
                     <th class="th">Вес двигателя, кг</th>
                     <th class="th">~145</th>
                 </tr>
                 <tr>
                     <th class="th">Расход  топлива, л/100 км (для E34 535i) <br>— город<br>— трасса<br>— смешан.<br></th>
                     <th class="th"><br>17.3 <br>8.0 <br>9.8</th>
                 </tr>
                 <tr>
                     <th class="th">Расход масла, гр./1000 км</th>
                     <th class="th">до 1000</th>
                 </tr>
                 <tr>
                     <th class="th">Масло в двигатель</th>
                     <th class="th">5W-30 <br> 5W-40 <br> 10W-40 <br> 15W-40</th>
                 </tr>
                 <tr>
                     <th class="th">Сколько масла в двигателе, л</th>
                     <th class="th">5.75</th>
                 </tr>
                 <tr>
                     <th class="th">Замена масла проводится, км</th>
                     <th class="th">7000-10000</th>
                 </tr>
                 <tr>
                     <th class="th">Рабочая температура двигателя, град.</th>
                     <th class="th">~90</th>
                 </tr>
                 <tr>
                     <th class="th">Ресурс двигателя, тыс. км <br>— по данным завода<br> — на практике</th>
                     <th class="th"><br>- <br>400+</th>
                 </tr>
                 <tr>
                     <th class="th">Тюнинг, л.с.<br>— потенциал<br>— без потери ресурса</th>
                     <th class="th"><br>800+ <br>н.д.</th>
                 </tr>
                 <tr>
                     <th class="th">Двигатель устанавливался</th>
                     <th class="th">BMW M535i E28 <br> BMW 535i E34 <br> BMW 635 CSi E24 <br> BMW 735i E32 <br> BMW M535i E12 <br> BMW 735i E23</th>
                 </tr>
             </body>
        </table>
        <div class="info-text">
            <h2>Надежность, проблемы и ремонт двигателя <br> БМВ М30Б35/М30Б34</h2>
            <p>До появления в 1992 году серии М60, с конфигурацией V8, ее место занимали большеобъемные рядные шестерки, под названием М30. Несмотря на то, что М30 выпускался одновременно с М20 (тоже рядный 6-ти цилиндровый), 30-я модель имеет больше общего с младшей четверкой М10. Первые М30 появились почти 50 лет назад и с течением времени постоянно дорабатывались и модернизировались. Один из топовых вариантов под названием M30B35/M30B34 был выпущен в 1982 году и предназначался для автомобилей BMW с индексом 35i.
                <br><br> Двигатель BMW M30B35/M30B34 представляет собой рядную шестерку в чугунном блоке цилиндров, таком же, как у M30B30, но коленвал имеет ход поршня 86 мм (против 80 мм у M30B30), диаметр цилиндров увеличен c 89 мм до 92 мм. Высота блока цилиндров не отличается. Длина шатуна — 135 мм, компрессионная высота поршня — 39.85 мм.
                <br> Головка блока цилиндров М30B34/B35 одновальная с 12-ю клапанами, без гидрокомпенсаторов, поэтому каждые 10 тыс. км желательно делать регулировку клапанов. Зазоры (холодный двигатель) на впуск и выпуск — 0.3 мм. Характеристики распределительного вала M30B35: фаза 248, подъем 8 мм.
                <br> Впускной коллектор изменен, используются форсунки производительностью 214 сс.
                <br> Привод ГРМ цепной. Система подачи топлива инжекторная.
                <br> Выпускались различные версии этого мотора: с катализатором, поршнями под степень сжатия 8 и Bosch Motronic 1.0, развивающие 185 л.с. при 5400 об/мин; без катализатора и с поршнями под степень сжатия 10, их отдача 218 л.с. при 5500 об/мин; а также катализаторная версия с поршнями под степень сжатия 9 и с Bosch Motronic 1.3, мощность таких M30B35 достигала 211 л.с. при 5700 об/мин.
                    В 1992 году двигатель М30В35 был заменен на более современный V8 — M60B40.</p>
            <h2>Проблемы и недостатки двигателей <br> BMW M30B35</h2>
                <p>1. Перегрев. Эта проблема свойственна многим рядным 6-ти цилиндровым двигателям BMW и запускать ее не стоит — поведет ГБЦ. Причина неисправности в грязном радиаторе, помпе, термостате или в воздушных пробках в системе охлаждения.
                <br> 2. Трещины в блоке цилиндров. Образуются вокруг резьб для болтов ГБЦ, по причине не удаления масла из резьбовых колодцев, после разборки двигателя. Симптомы, указывающие на появление трещин в М30: уход антифриза, эмульсия в масле. Можно пытаться решить вопрос ремонтом, но надежней и правильней купить блок цилиндров б/у без трещин.
                <br> Учитывая очень преклонный возраст моторов БМВ М30, к вышеперечисленному добавляется износ всего, что только возможно: чаще всего проблемы возникают в механизме газораспределения, с последующей невозможностью регулировки клапана, это решается заменой эксцентриков, изношенных клапанов, направляющих втулок. Нередки также неисправности связанные с ДМРВ.
                <br> На данный момент все двигатели BMW M30 выкатали свой ресурс, несмотря на то, что он запросто может превышать 500000 км. Также, зачастую автомобили с М30 эксплуатируют достаточно жестко (особенно Е34), это дополнительно накладывает свой отпечаток.
                        Сам по себе BMW M30B35 великолепный двигатель для своего времени, но возраст берет свое. Если хотите купить БМВ и стоит выбор между М30 или М50 (и другими моторами этой серии), стоит брать более свежий М50. </p>
                <h2>Тюнинг двигателя BMW M30B35<br>M30B35 Атмо. Строкер</h2>
                <p>Тюнинговых запчастей на М30 немало и при наличии денег, можно снять с него немного лошадей, но для начала приведите свой мотор в нормальное состояние, если двигатель просит капиталки, то тут никакие валы вам не помогут. После восстановления M30B35 есть два пути: сделать строкер или атмосферник на валах.
                <br> Первый вариант предполагает установку коленвала с ходом поршня 98 мм, коротких шатунов и расточку цилиндров под кованые поршни 93.4 мм. Это обеспечит 4.0 л рабочего объема, расточив до 95 мм, вы получите 4.2 л, больше нельзя. Стоимость подобных китов выше стоимости всего автомобиля.
                <br> Второй путь: вам нужно отфрезеровать ГБЦ для повышения степень сжатия до ~11, доработать каналы и камеры сгорания, также вам понадобится спортивный впуск, распредвал Schrick 284/280 (или другой похожий) с пружинами, усиленные рокеры, 76 мм прямоточный выпуск и настройка мозгов. Все это позволит снять около 240-250 л.с., но поршневая старая, тяжелая, крутится неохотно, и лучше заменить ее на легкую ковку, добавить дросселя от S38. В итоге дешевле купить BMW S38 на дросселях с 340 л.с. и сделать свап.</p>
            <h2>Турбо M30B35</h2>
            <p>Двигатели БМВ М30 с завода имеют очень низкую степень сжатия, поэтому разжимать под наддув не нужно, а значит надуть гораздо проще, чем сделать атмосферник. Купите на eBay дешевый китайский турбо кит для БМВ М30 и установите его на сток мотор. Или раздельно купите китайский Garrett GT35, с коллектором, пайпами 3 дюймовыми, интеркулером, вестгейтом, блоу-оффом, форсунками 630 сс и блоком управления Megasquirt. Надуете 0.8-1 бар и получите под 400 л.с. Китайские турбины живут недолго, несколько тысяч км и нужно менять. Оригинальный 35-й гарретт гораздо лучше и эффективней, но цена отличается в разы.
            <br> Нечто подобное можно собрать, используя компрессор, но с турбиной будет эффективней.</p>
            <h1>РЕЙТИНГ ДВИГАТЕЛЯ: 4+</h1>
        </div>
    </div>
</div>
</template>
<style scoped>
.menu {
    margin-top: 130px;
}
.information {
    border: solid 1px black ;
    border-radius: 20px;
    width: 700px;
    height: 3050px;
    background-color: rgb(125, 165, 165);
    margin-bottom: 20px;
    margin-top: 40px;
    margin-left: auto;
    margin-right: auto;
}
.table-body {
    width: 700px;
    height: 500px;
    margin-left: auto;
    margin-right: auto;
    padding: 20px;
}
.tr {
    width: 600px;
    height: 20px;
}
.th {
    border-radius: 10px;
    background-color: rgb(250, 205, 120);
    width: 600px;
    height: 25px;
}
.info-text {
    color: black;
    width: 600px;
    margin: auto;
}
</style>
